water-hammer/case-1d-3d/fluid3d-openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        outOfBounds     clamp;
        // Time-varying outlet velocity
        type            uniformFixedValue;
        uniformValue    table
                        (
                            ( 0   ( 0 0 0 ) )
                            ( 5   ( 0 1 0 ) )
                            ( 100 ( 0 1 0 ) )
                        );
    }
    xEmpty1
    {
       // type            fixedValue;
       // value           uniform (0 0 0);

     // type            empty;
            type           symmetryPlane;
    }

    xEmpty2
    {
       // type            fixedValue;
       // value           uniform (0 0 0);

      // type            empty;
          type           symmetryPlane;
    }

    yEmpty1
    {
       //type            fixedValue;
      // value           uniform (0 0 0);

       //type            empty;
          type           symmetryPlane;
    }

    yEmpty2
    {
      //type            fixedValue;
      // value           uniform (0 0 0);

      // type            empty;
          type           symmetryPlane;
    }

}


// ************************************************************************* //
